Repository: 68foxboris/ssupport
Catalog: src/locale/*/LC_MESSAGES/*.po
Languages: sk

source: List of storage devices
sk: Zoznam úložných zariadení

source: Parent directory
sk: Nadradený priečinok

source: nothing connected
sk: nič pripojené

source: Language selection
sk: Výber jazyka

source: Type text of picture
sk: Zadajte text obrázka

source: unpack error: cannot get subname
sk: chyba pri rozbaľovaní: nemožno získať podnázov

source: unpack error: cannot open archive
sk: chyba rozbaľovania: nie je možné otvoriť archív

source: Save
sk: Uložiť

source: Cancel
sk: Zrušiť

source: Reset Defaults
sk: Obnoviť predvolené nastavenia

source: General settings
sk: Všeobecné nastavenia

source: External subtitles settings
sk: Nastavenia externých titulkov

source: Embedded subtitles settings
sk: Nastavenia vložených titulkov

source: Search settings
sk: Nastavenia vyhľadávania

source: DVB player settings
sk: Nastavenia prehrávača DVB

source: SubsSupport settings
sk: Nastavenia SubsSupport

source: You have OpenPli-based image, please change embedded subtitles settings in Settings / System / Subtitles settings
sk: Máte obraz založený na OpenPli, zmeňte prosím nastavenia vložených titulkov v Nastavenia / Systém / Nastavenia titulkov

source: Change subssupport settings
sk: Zmena nastavenia podpory

source: Download subtitles for your videos
sk: Stiahnite si titulky pre svoje videá

source: watch DVB broadcast with subtitles
sk: sledovať vysielanie DVB s titulkami

source: SubsSupport DVB player
sk: Podporovaný prehrávač DVB

source: top
sk: hore

source: bottom
sk: dole

source: red
sk: červená

source: grey
sk: šedá

source: green
sk: zelená

source: purple
sk: ružová

source: yellow
sk: žltá

source: white
sk: biela

source: blue
sk: modrá

source: black
sk: čierna

source: opaque
sk: nepriehľadné

source: transparent
sk: priesvitné

source: border
sk: okraj

source: offset
sk: poČiare

source: dynamic
sk: dynamický

source: static
sk: statický

source: List
sk: Zoznam

source: List + File
sk: Zoznam + súbor

source: All
sk: Všetko

source: Provider
sk: Poskytovateľ

source: Language
sk: Jazyk

source: Default
sk: Predvolený

source: Release
sk: Uvoľniť

source: Video filename
sk: Názov súboru videa

source: User defined
sk: Definované užívateľom

source: Next to video
sk: Prehrať ďalšie video

source: Movie
sk: Film

source: TV show
sk: Televízna relácia

source: jump to next subtitle
sk: skok na ďalší titulok

source: jump to previous subtitle
sk: skok na predchádzajúci titulok

source: increase subtitles delay
sk: zvýšiť oneskorenie titulkov

source: decrease subtitles delay
sk: zníženie oneskorenia titulkov

source: reset subtitles delay/fps
sk: resetovanie oneskorenia titulkov/fps

source: change subtitles fps
sk: zmena titulkov fps

source: displays this menu
sk: zobrazí túto ponuku

source: exit
sk: ukončiť

source: Subtitles FPS
sk: Titulky FPS

source: unknown
sk: neznáme

source: original
sk: originál

source: Subtitles Delay
sk: Oneskorenie titulkov

source: change external subtitles status
sk: zmena stavu externých titulkov

source: No external subtitles are loaded
sk: Nie sú načítané žiadne externé titulky

source: show subtitles menu
sk: zobraziť ponuku titulkov

source: Cannot load subtitles. Invalid path
sk: Nie je možné načítať titulky. Nesprávna cesta

source: Cannot decode subtitles. Try another encoding group
sk: Nie je možné dekódovať titulky. Skúste inú skupinu kódovania

source: Cannot parse subtitles. Not supported subtitles format
sk: Nie je možné analyzovať titulky. Nepodporovaný formát titulkov

source: Cannot parse subtitles. Invalid subtitles format
sk: Nie je možné analyzovať titulky. Neplatný formát titulkov

source: Currently choosed subtitles
sk: Aktuálne vybrané titulky

source: Embedded Subtitles
sk: Vložené titulky

source: Encoding:
sk: Kódovanie:

source: cannot decode
sk: nemožno dekódovať

source: None
sk: Žiadne

source: Choose subtitles
sk: Výber titulkov

source: Search subtitles
sk: Vyhľadávanie titulkov

source: Change encoding
sk: Zmena kódovania

source: Subtitles settings
sk: Nastavenia titulkov

source: Subtitles settings (embedded)
sk: Nastavenia titulkov (vložené)

source: Turn off subtitles
sk: Vypnutie titulkov

source: Some subtitles providers are not working
sk: Niektorí poskytovatelia titulkov nefungujú

source: For more details please check search settings
sk: Ďalšie podrobnosti nájdete v nastaveniach vyhľadávania

source: Do you want to show this message again?
sk: Chcete túto správu zobraziť znova?

source: Font type (Regular)
sk: Typ písma (Regular)

source: Font color (Regular)
sk: Farba písma (Regular)

source: Font transparency (Regular)
sk: Priehľadnosť písma (Regular)

source: Font type (Italic)
sk: Typ písma (Kurzíva)

source: Font color (Italic
sk: Farba písma (Kurzíva)

source: Font transparency (Italic)
sk: Priehľadnosť písma (Italic)

source: Font type (Bold)
sk: Typ písma (tučné)

source: Font color (Bold)
sk: Farba písma (tučná)

source: Font transparency (Bold)
sk: Priehľadnosť písma (Bold)

source: Font size
sk: Veľkosť písma

source: Position
sk: Pozícia

source: Shadow
sk: Bez tieňa

source: Shadow type
sk: Typ tieňa

source: Shadow X-offset
sk: Tieň titulkov X odsadenie

source: Shadow Y-offset
sk: Tieň titulkov Y odsadenie

source: Shadow size
sk: Veľkosť tieňa

source: Shadow color
sk: Farba tieňa

source: Background
sk: Pozadie

source: Background type
sk: Typ pozadia

source: Background X-offset
sk: Odsadenie pozadia X

source: Background Y-offset
sk: Odsadenie pozadia Y

source: Background color
sk: Farba pozadia

source: Background transparency
sk: Priehľadnosť pozadia

source: External Subtitles settings
sk: Nastavenia externých titulkov

source: Subtitles setting
sk: Nastavenie titulkov

source: Pause video on opening subtitles menu
sk: Pozastavenie videa pri otvorení ponuky titulkov

source: Encoding
sk: Kódovanie

source: Show expert settings
sk: Zobraziť expertné nastavenia

source: Hide delay
sk: Skryť oneskorenie

source: Sync delay
sk: Oneskorenie synchronizácie

source: Player delay
sk: Oneskorenie hráča

source: Refresh delay
sk: Oneskorenie obnovenia

source: PTS check delay
sk: Oneskorenie kontroly PTS

source: Color
sk: Farba

source: Choose from embedded subtitles
sk: Výber z vložených titulkov

source: Choose from downloaded subtitles
sk: Výber zo stiahnutých titulkov

source: Choose from web subtitles
sk: Vyberte si z webových titulkov

source: Subtitles will be downloaded in
sk: Titulky "%s" stiahnuté správne

source: seconds
sk: sekundy

source: Choose Subtitles
sk: Výber titulkov

source: Name
sk: Meno

source: Download date
sk: Dátum stiahnutia

source: Remove (file)
sk: Odstrániť súbor

source: Settings
sk: Nastavenia

source: Downloaded Subtitles
sk: Stiahnuté titulky

source: Entries count:
sk: Počet záznamov:

source: Remove Entry (List+File)
sk: Odstránenie položky (Zoznam+Súbor)

source: Remove Entry (List)
sk: Odstránenie položky (zoznam)

source: There was an error while removing subtitle, please check log
sk: Pri odstraňovaní titulkov došlo k chybe, skontrolujte prosím protokol

source: will be removed from file system
sk: bude odstránený zo systému súborov

source: Subtitle
sk: Podnadpis

source: Do you want to proceed?
sk: Chceš pokračovať?

source: will be removed from list
sk: bude odstránený zo zoznamu

source: Downloaded Subtitles - Settings
sk: Stiahnuté titulky - Nastavenia

source: Max history entries
sk: Maximálny počet záznamov v histórii

source: Remove action
sk: Odstránenie akcie

source: Ask on remove action
sk: Spýtajte sa na odstránenie akcie

source: Select Directory
sk: Vybrať priečinok

source: Suggestions
sk: Návrhy

source: press green
sk: stlačte zelenú farbu

source: press red
sk: stlačiť červenú

source: History
sk: História

source: Save to
sk: Uložiť do

source: Save as
sk: Uložiť ako

source: Append language to filename
sk: Pripojenie jazyka k názvu súboru

source: Filename
sk: Názov súboru

source: Path
sk: Cesta

source: Reset
sk: Resetovať

source: Download options
sk: Možnosti stiahnutia

source: Edit Filename
sk: Upraviť názov súboru

source: Edit download path
sk: Úprava cesty na prevzatie

source: Filename cannot be empty!
sk: Názov súboru nemôže byť prázdny!

source: Path doesn't exist!
sk: Cesta neexistuje!

source: Update
sk: Aktualizovať

source: Search
sk: Hľadať

source: Subtitles search
sk: Vyhľadávanie titulkov

source: no
sk: nie

source: yes
sk: áno

source: Title
sk: Názov

source: Type
sk: Typ

source: Year
sk: Rok

source: Season
sk: Sezóna

source: Episode
sk: Epizóda

source: Preferred languages
sk: Uprednostňované jazyky

source: Use File path
sk: Použiť cestu k súboru

source: Update search parameters if not correct and press green button for search
sk: Aktualizácia parametrov vyhľadávania, ak nie sú správne a stlačte zelené tlačidlo pre vyhľadávanie

source: loading subtitles list
sk: načítanie zoznamu titulkov

source: subtitles found
sk: nájdené titulky

source: Press OK to Stop
sk: Stlačením tlačidla OK zastavíte

source: No subtitles found :(
sk: Nenašli sa žiadne titulky :(

source: Try update(simplify) search expression and try again..
sk: Skúste aktualizovať(zjednodušiť) vyhľadávací výraz a skúste to znova..

source: downloading subtitles...
sk: sťahovanie titulkov...

source: There are more subtitles in unpacked archive please select which one do you want to use
sk: V rozbalenom archíve sú ďalšie titulky vyberte si, ktorý chcete použiť

source: Subtitles with this name already exist Do you want to overwrite them
sk: Titulky s týmto názvom už existujú Chcete ich prepísať

source: Cannot save download history, for details look in log
sk: Nie je možné uložiť históriu sťahovania, podrobnosti nájdete v denníku

source: captcha doesn't match, try again...
sk: captcha sa nezhoduje, skúste to znova...

source: invalid credentials provided, correct them and try again
sk: zadané neplatné poverenia, opravte ich a skúste to znova

source: no credentials provided, set them and try again
sk: neboli poskytnuté žiadne poverenia, nastavte ich a skúste to znova

source: download error ocurred, for details see /tmp/subssearch.log
sk: vyskytla sa chyba pri sťahovaní, podrobnosti nájdete v /tmp/subssearch.log

source: Download (user defined)
sk: Stiahnutie (definované používateľom)

source: Download (next to video)
sk: Na stiahnutie (vedľa videa)

source: Download (more...)
sk: Na stiahnutie (viac...)

source: Download and Load (user defined)
sk: Stiahnutie a načítanie (definované používateľom)

source: Download and Load (next to video)
sk: Stiahnuť a načítať (vedľa videa)

source: Download and Load (more...)
sk: Stiahnuť a načítať (viac...)

source: Preferred subtitles language
sk: Uprednostňovaný jazyk titulkov

source: Preferred Movie provider
sk: Uprednostňovaný poskytovateľ filmov

source: Preferred TV show provider
sk: Uprednostňovaný poskytovateľ televíznych programov

source: Manual search
sk: Manuálne vyhľadávanie

source: Subtitles provider timeout
sk: Časový limit poskytovateľa titulkov

source: Check search parameters before subtitles search
sk: Kontrola parametrov vyhľadávania pred vyhľadávaním titulkov

source: Sort subtitles list by
sk: Zoradiť zoznam titulkov podľa

source: Save subtitles as
sk: Uložiť titulky ako

source: Save subtitles as (fallback)
sk: Uložiť titulky ako (náhradné riešenie)

source: Add subtitle's language to filename
sk: Pridanie jazyka titulkov do názvu súboru

source: Save subtitles to
sk: Uloženie titulkov do

source: Subtitles download path
sk: Cesta na stiahnutie titulkov

source: Subtitles temp path
sk: Dočasná cesta k titulkom

source: Always ask before overwriting existing subtitles
sk: Pred prepísaním existujúcich titulkov sa vždy opýtajte

source: Load subtitles after download
sk: Načítanie titulkov po stiahnutí

source: Save downloaded subtitles to history
sk: Uloženie prevzatých titulkov do histórie

source: Load/Save download history directory
sk: Načítanie/uloženie adresára histórie sťahovania

source: Provider name
sk: Názov poskytovateľa

source: Supported languages
sk: Podporované jazyky

source: State
sk: Štát

source: Switch List
sk: Zoznam prepínačov

source: Subtitles search settings
sk: Nastavenia vyhľadávania titulkov

source: error
sk: chyba

source: enabled
sk: zapnuté

source: disabled
sk: vypnuté

source: library
sk: knižnica

source: missing
sk: chýba

source: Source title not provided
sk: Názov zdroja nie je uvedený

source: Source title
sk: Názov zdroja

source: Update Search params
sk: Aktualizácia parametrov vyhľadávania

source: settings
sk: nastavenia

source: Auto sync to current event
sk: Automatická synchronizácia s aktuálnou udalosťou

source: Subtitles Position
sk: Pozícia titulkov

source: Subtitles Time
sk: Čas titulkov

source: Event Name
sk: Názov podujatia

source: Event Time
sk: Čas udalosti

source: Event Duration
sk: Trvanie podujatia

source: close plugin
sk: zatvoriť zásuvný modul

source: show/hide subtitles status
sk: zobraziť/skryť stav titulkov

source: play/pause subtitles playback
sk: prehrávanie/pozastavenie prehrávania titulkov

source: pause subtitles playback
sk: pozastavenie prehrávania titulkov

source: resumes subtitles playback
sk: obnoví prehrávanie titulkov

source: restarts current subtitle
sk: reštartuje aktuálny titulok

source: skip to next subtitle
sk: preskočiť na ďalší titulok

source: skip to next subtitle (minute jump)
sk: preskočiť na ďalší titulok (minútový skok)

source: skip to next subtitle by setting time in minutes
sk: preskočiť na ďalší titulok nastavením času v minútach

source: skip to previous subtitle
sk: preskočiť na predchádzajúci titulok

source: skip to previous subtitle (minute jump)
sk: preskočiť na predchádzajúci titulok (minútový skok)

source: skip previous subtitle by setting time in minutes
sk: preskočiť predchádzajúci titulok nastavením času v minútach

source: skip subtitle to current event position
sk: preskočiť titulok na pozíciu aktuálnej udalosti

source: Time
sk: Čas

source: Duration
sk: Trvanie

source: cannot sync to event, event is not available
sk: nemožno synchronizovať s udalosťou, udalosť nie je k dispozícii
